benchmarks/1_nginx_static.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.24.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /test.html
Document Length:        39 bytes

Concurrency Level:      100
Time taken for tests:   0.214 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      372000 bytes
HTML transferred:       78000 bytes
Requests per second:    9330.75 [#/sec] (mean)
Time per request:       10.717 [ms] (mean)
Time per request:       0.107 [ms] (mean, across all concurrent requests)
Transfer rate:          1694.84 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5   1.3      5       9
Processing:     1    6   1.5      6      10
Waiting:        0    4   1.6      4       9
Total:          6   10   0.9     10      14

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     11
  75%     11
  80%     11
  90%     12
  95%     12
  98%     13
  99%     13
 100%     14 (longest request)