benchmarks/2_gunicorn_static.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /test.html
Document Length:        39 bytes

Concurrency Level:      100
Time taken for tests:   0.733 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      346000 bytes
HTML transferred:       78000 bytes
Requests per second:    2729.05 [#/sec] (mean)
Time per request:       36.643 [ms] (mean)
Time per request:       0.366 [ms] (mean, across all concurrent requests)
Transfer rate:          461.06 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       4
Processing:     1   35   6.3     35      49
Waiting:        1   35   6.3     35      49
Total:          5   35   5.9     35      50

Percentage of the requests served within a certain time (ms)
  50%     35
  66%     37
  75%     38
  80%     40
  90%     43
  95%     45
  98%     46
  99%     48
 100%     50 (longest request)