benchmarks/3_gunicorn_dynamic.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /?test=1
Document Length:        52 bytes

Concurrency Level:      100
Time taken for tests:   0.856 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      372000 bytes
HTML transferred:       104000 bytes
Requests per second:    2335.19 [#/sec] (mean)
Time per request:       42.823 [ms] (mean)
Time per request:       0.428 [ms] (mean, across all concurrent requests)
Transfer rate:          424.17 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       4
Processing:     1   42  11.6     38      78
Waiting:        1   41  11.6     38      78
Total:          5   42  11.4     38      78

Percentage of the requests served within a certain time (ms)
  50%     38
  66%     40
  75%     44
  80%     51
  90%     60
  95%     64
  98%     71
  99%     75
 100%     78 (longest request)