benchmarks/4_nginx_proxy_no_cache.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.24.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /?test=1
Document Length:        52 bytes

Concurrency Level:      100
Time taken for tests:   0.758 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      398000 bytes
HTML transferred:       104000 bytes
Requests per second:    2638.63 [#/sec] (mean)
Time per request:       37.898 [ms] (mean)
Time per request:       0.379 [ms] (mean, across all concurrent requests)
Transfer rate:          512.78 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.3      0       8
Processing:     2   36   4.8     36      47
Waiting:        1   36   4.9     36      47
Total:          9   37   4.0     37      47

Percentage of the requests served within a certain time (ms)
  50%     37
  66%     37
  75%     38
  80%     39
  90%     41
  95%     43
  98%     46
  99%     47
 100%     47 (longest request)