benchmarks/5_nginx_proxy_with_cache.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.24.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /?test=1
Document Length:        52 bytes

Concurrency Level:      100
Time taken for tests:   0.271 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      398000 bytes
HTML transferred:       104000 bytes
Requests per second:    7380.10 [#/sec] (mean)
Time per request:       13.550 [ms] (mean)
Time per request:       0.135 [ms] (mean, across all concurrent requests)
Transfer rate:          1434.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6   2.6      5      15
Processing:     1    7   2.9      6      17
Waiting:        1    5   2.7      4      16
Total:          6   13   3.9     11      26

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     13
  75%     15
  80%     16
  90%     20
  95%     21
  98%     23
  99%     25
 100%     26 (longest request)